// age 상수로 나이를 설정한다(임의)
// 19세 이상 성인이라면 "입장 가능"
// 성인이 아니라면 "입장 불가"
// 성인과 관계 없이 age가 짝수라면 "당첨"을 출력

export default function page() {
    const age: number = 20;

    return (
        <>
            {age >= 19 ? (
                <>
                    <p>입장가능</p>
                </>
            ) : (
                <>
                    <p>입장불가</p>
                </>
            )}
            {!(age % 2) ? ( 
                <>
                    <p>당첨</p>
                </>
            ) : (
                <>  
                    <p>꽝ㄴ</p>
                </>
            )}
        </>
    );
}